In [1]:
'''
Exercise #17.1 on page 799 of our course textbook

Name: Deep Patel
'''

'\nExercise #17.1 on page 799 of our course textbook\n\nName: Deep Patel\n'

In [2]:
import sqlite3

In [3]:
connection = sqlite3.connect('C:/Users/patel/onedrive/desktop/Chapter17/books.db')

In [4]:
import pandas as pd

# 17.1 (a)

In [5]:
pd.options.display.max_columns = 10

In [6]:
pd.read_sql('SELECT last FROM authors ORDER BY last DESC',
            connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

# 17.1 (b)

In [7]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC',
            connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

# 17.3 (c)

In [8]:
pd.read_sql("""
    SELECT authors.first, authors.last, titles.title, titles.copyright, titles.isbn
    FROM authors
    INNER JOIN author_ISBN 
        ON authors.id = author_ISBN.id
    INNER JOIN titles 
        ON author_ISBN.isbn = titles.isbn
    WHERE authors.first = 'Paul' AND authors.last = 'Deitel'
    ORDER BY titles.title ASC
""", connection).head()

  first    last                          title copyright        isbn
0  Paul  Deitel      Android 6 for Programmers      2016  0134289366
1  Paul  Deitel         Android How to Program      2017  0134444302
2  Paul  Deitel               C How to Program      2016  0133976890
3  Paul  Deitel             C++ How to Program      2017  0134448235
4  Paul  Deitel  Internet & WWW How to Program      2012  0132151006

# 17.1 (d)

In [9]:
cursor = connection.cursor()

cursor = cursor.execute("""INSERT INTO authors (first, last)
                           VALUES ('Joany', 'Applesmith')""")

pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first        last
id
1        Paul      Deitel
2      Harvey      Deitel
3       Abbey      Deitel
4         Dan       Quirk
5   Alexander        Wald
6       Joany  Applesmith

# 17.1 (e)

In [13]:
cursor = connection.cursor()

cursor = cursor.execute("""INSERT INTO titles (isbn, title, edition, copyright)
                           VALUES ('2094420', 'My new book title!', '1', '2024')""")

pd.read_sql('SELECT * FROM titles', connection)

          isbn                             title  edition copyright
0   0135404673     Intro to Python for CS and DS        1      2020
1   0132151006     Internet & WWW How to Program        5      2012
2   0134743350               Java How to Program       11      2018
3   0133976890                  C How to Program        8      2016
4   0133406954  Visual Basic 2012 How to Program        6      2014
5   0134601548          Visual C# How to Program        6      2017
6   0136151574         Visual C++ How to Program        2      2008
7   0134448235                C++ How to Program       10      2017
8   0134444302            Android How to Program        3      2017
9   0134289366         Android 6 for Programmers        3      2016
10     2094420                My new book title!        1      2024